tests/fixtures/liqpay/checkout-response-success.json

{
  "payment_id": 123456789,
  "action": "pay",
  "status": "success",
  "version": 3,
  "type": "buy",
  "paytype": "card",
  "public_key": "XXXXXXXXXXX",
  "acq_id": 888888888,
  "order_id": "0987654",
  "liqpay_order_id": "XXXXXXXXXXX",
  "description": "Order #132",
  "sender_first_name": "Oleksii",
  "sender_last_name": "Oleksii",
  "sender_card_mask2": "424242*42",
  "sender_card_bank": "Test",
  "sender_card_type": "visa",
  "sender_card_country": 804,
  "ip": "127.0.0.1",
  "amount": 1760.0,
  "currency": "UAH",
  "sender_commission": 0.0,
  "receiver_commission": 26.4,
  "agent_commission": 0.0,
  "amount_debit": 1760.0,
  "amount_credit": 1760.0,
  "commission_debit": 0.0,
  "commission_credit": 26.4,
  "currency_debit": "UAH",
  "currency_credit": "UAH",
  "sender_bonus": 0.0,
  "amount_bonus": 0.0,
  "mpi_eci": "7",
  "is_3ds": false,
  "language": "en",
  "create_date": 1723558870807,
  "end_date": 1723558870949,
  "transaction_id": 123456789
}